{
  "about": [
    {
      "tech": [
        "Computer programming",
        "Web development",
        "Mobile development",
        "Database management",
        "System administration",
        "Cloud computing",
        "Front-end frameworks",
        "Responsive design"
      ]
    }
  ],
  "experience": [
    {
      "id": 1,
      "company": "Fiverr Freelance",
      "linkCompany": "https://www.fiverr.com/",
      "position": "Software Developer (FreeLance)",
      "startDate": "05-16-2023",
      "endDate": "Present",
      "tech": [
        "React JS",
        "Express JS",
        "Node JS",
        "Tailwind CSS",
        "Bootstrap",
        "Mongo DB",
        "Laravel"
      ],
      "jobDesc": [
        "Developed and deployed custom web applications using the MERN (MongoDB, Express.js, React.js, Node.js) stack, delivering scalable and efficient solutions tailored to client requirements.",
        "Automated repetitive tasks and streamlined workflows by writing Python and Bash scripts, improving development and deployment processes.",
        "Provided ongoing maintenance and support for existing web applications, ensuring optimal performance and security.",
        "Collaborated with clients to gather requirements, plan project milestones, and provide regular updates on progress and deliverables.",
        "Implemented version control using Git for project management and collaboration, facilitating code review and continuous integration."
      ]
    },
    {
      "id": 2,
      "company": "ClickOut Media LTD",
      "linkCompany": "https://clickout.com/",
      "position": "Technical Writer",
      "startDate": "11-13-2023",
      "endDate": "Present",
      "tech": ["Mongo DB", "Express JS", "React JS", "Node JS"],
      "jobDesc": [
        "Wrote comprehensive documentation for JavaScript frameworks such as React, Angular, and Vue.js, including detailed explanations of concepts like React Hooks, Angular routing, and Vue.js lifecycle methods.",
        "Authored user manuals and guides for various database systems, including MongoDB, MySQL, and PostgreSQL, providing in-depth comparisons between relational and non-relational databases, and detailed instructions on database setup, querying, and optimization.",
        "Created tutorials and instructional content for developers on advanced topics like ES6 features, asynchronous programming in Node.js, and best practices for version control using Git.",
        "Collaborated closely with development teams to ensure accuracy and clarity of technical documentation, actively participating in code reviews and providing feedback on API documentation, code samples, and integration guides."
      ]
    },
    {
      "id": 3,
      "company": "iTalanta hub",
      "linkCompany": "https://italanta.net/",
      "position": "Software Developer (internship)",
      "startDate": "11-01-2022",
      "endDate": "02-10-2022",
      "tech": [
        "React JS",
        "Express JS",
        "Node JS",
        "Tailwind CSS",
        "Bootstrap",
        "Mongo DB"
      ],
      "jobDesc": [
        "Contributed to maintaining and implementing the design-to-code process for <a href='https://italanta.net/ target='_blank' class='underline'>iTalanta Hub</a>, utilizing React JS and Tailwind CSS",
        "Contributed to maintaining and implementing the design-to-code process for <a href='https://italanta.net/ target='_blank' class='underline'>Admin iTalanta</a>, utilizing React JS & Tailwind CSS.",
        "Successfully developed and implemented the design-to-code processes for <a href='https://www.basi-go.com/ target='_blank' class='underline'>BasiGo</a>, utilizing React js, Boostrap & MUI",
        "Collaborated with UI/UX Designer to create visually appealing and user friendly.",
        "Collaborated with Back-end Engineers to create RESTFUL APIs for seamless communication between front-end and back-end systems."
      ]
    }
  ],
  "project": [
    {
      "title": "Foodie Express",
      "imgUrl": "./img/project/foodie.png",
      "tech": ["Mongo DB", "Express JS", "React JS", "Node JS", "Tailwind CSS"],
      "description": "Foodie Express is a modern food delivery web application designed to connect customers with their favorite local restaurants, while also empowering users to become restaurant owners themselves.",
      "linkGithub": "https://github.com/JohnKamaujk/foodie-express",
      "linkWebsite": "https://foodie-express-app.onrender.com"
    },
    {
      "title": "JobHub Connect",
      "imgUrl": "./img/project/jobhub.png",
      "tech": ["Mongo DB", "Express JS", "React JS", "Node JS", "Tailwind CSS"],
      "description": "A Job Board Application that simplifies job searches for users and eases recruitment for administrators. Users can browse curated job listings, filter by location, industry, or job type, and create personalized accounts with resume/CV and job preferences.",
      "linkGithub": "https://github.com/JohnKamaujk/JobHub_Connect",
      "linkWebsite": "https://jobhub-connect-app.onrender.com"
    },    {
      "title": "Catrix",
      "imgUrl": "./img/project/catrix.png",
      "tech": ["Bootstrap","Laravel","wordpress"],
      "description": "Catrix, a website for the renowned Catrix 5-star restaurant in Nairobi, Kenya, boasts a sleek UI crafted with Bootstrap and PHP for seamless interactivity.",
      "linkGithub": "https://github.com/JohnKamaujk/catrix",
      "linkWebsite": "https://catrix.vercel.app"
    }
  ]
}
